{
    "type": "Collection",
    "id": "california_wildfires_202501_burn_severity",
    "stac_version": "1.0.0",
    "description": "Date of Image(s) Sentinel-1 Synthetic Aperture Radar (SAR):12/28/2024 (Pre-fire)01/09/2025 (Called post-fire, but fires may still burning)Sentinel-2 MultiSpectral Instrument (MSI):01/02/2025 (Pre-fire)01/12/2025 (Called post-fire, but fires may still burning)Date of Next Image Sentinel-1 Synthetic Aperture Radar (SAR):01/21/2025Sentinel-2 MultiSpectral Instrument (MSI):01/17/2025Ancillary data ESA Global Land Cover in 202101/23/2025SummaryThe burned areas and burn severity levels for vegetation and urban areas were generated separately based on an integration of Sentinel-2 and Sentinel-1 data. Specifically, the Sentinel-2 MSI data provide large changes in vegetation reflectance after burning due to changes in near-infrared (NIR) and shortwave-infrared (SWIR) bands, but changes in these spectral ranges were less obvious or nonexistent in affected urban environments. In a complementary sense, Sentinel-1 synthetic aperture radar (SAR) is sensitive to surface roughness changes, a signal which is more apparent (usually rougher or higher backscatter) due to the fire destruction of built infrastructure. Thus, we leveraged these two key physical characteristics together to distinguish the urban-burned areas and vegetation-burned areas. Note that while the magnitude of calculated changes in NIR, SWIR, and SAR backscatter in pre-and post-event imagery imply a range of burn severity, these metrics are still considered proxies for actual burn severity and should be interpreted as such.  We first calculated the differenced Normalized Burn Ratio (dNBR = NBR_pre – NBR_post) from Sentinel-2 data in which the NBR = (NIR – SWIR)/(NIR+SWIR). This provides critical changes in vegetation due to burning. Second, we calculated the differenced vertical/horizontal polarization (VH) backscatter (dVH = VH_post – VH_pre) from Sentinel-1 SAR data. The ESA Land Cover classification map and the relationship between dNBR and dVH were used to distinguish urban and vegetation-burned areas.The generated dNBR was used to divide the vegetation-burned areas into 4 groups: Low (values ≤0.25), Moderate (0.25&lt; values ≤0.35), High (0.35&lt; values ≤0.45), and Very High (values &gt;0.45). The generated dVH was used to divide the urban-burned areas into 3 groups: Low (values ≤1), Moderate (1&lt; values ≤4), and High (values &gt;4). Notes that these thresholds were defined for contrast visualization of severity levels across four southern California fires and may not reflect other regions.All analysis was performed in Google Earth Engine. From these layers, we can clearly see the vegetation and urban-burned areas and their burn levels. The structure damage could be overlayed on top of burn maps generated by the integration of Sentinel-1 and -2.The maps were preliminary results only and no ground-validation has been considered at the time of posting. To separate vegetation and urban-burned areas, we applied the empirical thresholds of Sentinel-2 dNBR and Sentinel-1 dVH, which could be imperfect in some locations on a large scale. Sentinel-1 SAR data was subject to signal noise in some areas likely due to terrain and speckle noise, which could lead to incorrect severity levels in urban-burned areas to some extents. Refinement of the results is in progress. Suggested UsageDespite the rawer form of this quick-look product, it is still useful for distinguishing vegetation and urban-burned areas and severity assessment. ResolutionSentinel-1A SAR C-band, 10m spatial resolution, 12 days revisit.Sentinel-2 MSI, 10-60m spatial resolution, ~5 days revisit with Sentinel-2A and -2B.CreditsKhuong Tran (ARC), Taejin Park (ARC), Aakash Chhabra (ARC), Weile Wang (ARC), Kyle Kabasares (ARC).",
    "links": [
        {
            "rel": "wms",
            "href": "https://maps.disasters.nasa.gov/ags03/services/california_wildfires_202501/burn_severity/MapServer/WMSServer",
            "type": "image/png",
            "title": "Visualized through a WMS",
            "wms:layers": [
                "Vegetation Burn Severity",
                "Urban Burn Severity"
            ],
            "wms:styles": [
                "default"
            ]
        },
        {
            "rel": "via",
            "href": "https://maps.disasters.nasa.gov/ags03/rest/services/california_wildfires_202501/burn_severity/MapServer",
            "type": "text/html",
            "title": "Parent ArcGIS server url"
        }
    ],
    "stac_extensions": [
        "https://stac-extensions.github.io/web-map-links/v1.2.0/schema.json"
    ],
    "dashboard:is_periodic": false,
    "dashboard:time_density": "year",
    "dashboard:is_timeless": true,
    "title": "california_wildfires_202501/burn_severity",
    "extent": {
        "spatial": {
            "bbox": [
                [
                    -118.72049902857805,
                    34.012768088520446,
                    -118.00516530313132,
                    34.36018931308597
                ]
            ]
        },
        "temporal": {
            "interval": [
                [
                    null,
                    null
                ]
            ]
        }
    },
    "license": "not-applicable"
}