{
    "type": "Collection",
    "id": "nrt_lis_vsm_percentile_100cm",
    "stac_version": "1.0.0",
    "description": "<div style='text-align:Left;'><p><font color='#ff0000'><b>NOTICE: Data is currently only available through May 18th due to server issues with the data provider. New data will appear automatically when the issues are resolved. </b></font></p><p><span style='font-weight:bold;'>Update Frequency:</span></p><p><span>Daily</span></p><p><span style='font-weight:bold;'>Summary</span><span>:</span></p><p><span>Land Information System (LIS) 0-100 cm layer Soil Moisture Percentile generated by the NASA SPoRT Center over a Contiguous United States domain.</span></p><p><span>The NASA Land Information System (LIS) is a high-performance land surface modeling and data assimilation system used to characterize land surface states and fluxes by integrating satellite-derived datasets, ground-based observations, and model re-analyses. The NASA SPoRT Center at MSFC developed a real-time configuration of the LIS (“SPoRT-LIS”), which is designed for use in experimental operations by domestic and international users. SPoRT-LIS is an observations-driven, historical and real-time modeling setup that runs the Noah land surface model over a full CONUS domain. It provides soil moisture estimates at approximately 3-km horizontal grid spacing over a 2-meter-deep soil column and has been validated for regional applications and against U.S. Drought Monitor products.</span></p><p><span>SPoRT-LIS consists of a 33-year soil moisture climatology spanning from 1981 to 2013, which is extended to the present time and forced by atmospheric analyses from the operational North American Land Data Assimilation System-Phase 2 through 4 days prior to the current time, and by the National Centers for Environmental Prediction Global Data Assimilation System in combination with hourly Multi-Radar Multi-Sensor precipitation estimates from 4 days ago to the present time. A unique feature of SPoRT-LIS is the incorporation of daily, real-time satellite retrievals of VIIRS Green Vegetation Fraction since 2012, which results in more representative evapotranspiration and ultimately soil moisture estimates than using a fixed seasonal depiction of vegetation in the model.  </span></p><p><span>The 33-year soil moisture climatology also provides the database for real-time soil moisture percentiles evaluated for all U.S. counties and at each modeled grid point. The present-day soil moisture analyses are compared to daily historical distributions to determine the soil wet/dry anomalies for the specific day of the year. Soil moisture percentile maps are constructed for the model layers, and these data are frequently referenced by scientists and operational agencies contributing to the weekly U.S. Drought Monitor product.</span></p><p><span style='font-weight:bold;'>Suggested Use: </span></p><p><span>This product can be used for drought assessment, fire risk assessment, potential for flooding hazards associated with heavy precipitation and high percentiles; contextualizing soil moisture content to historical values. </span></p><p><span>Soil moisture percentiles are shown using a Classified Color Ramp (Multi-Color, 11-classes) that colorize the low percentile categories (≤ 30th) as shown in the U.S. Drought Monitor weekly products, ranging from yellow to dark red. The high percentile categories (≥ 70th) are colorized with increasing blue intensity.  Intermediate percentiles in the 30th to 70th range are assigned a nominal gray shade.</span></p><p><span>The 0-100 cm layer combines SPoRT-LIS soil moisture analyses from the top three model layers 0-10 cm, 10-40 cm, and 40-100 cm.  The 0-100 cm cumulative layer adjusts more slowly to precipitation episodes or the lack thereof compared to the 0-10 cm and 0-40 cm percentiles.  It takes considerably longer time periods for intercepted rainfall and snowmelt to infiltrate from the upper 0-10 cm and 10-40 cm layers into the next model layer at 40-100 cm, or conversely for the deeper soil layer to dry from evapotranspiration processes.  Expect anomalies of soil moisture percentiles in the 0-100 cm cumulative layer to respond on the order of weeks to months (or longer, especially during dry periods), depending on the soil classification and soil responsiveness.  </span></p><p><span style='font-weight:bold;'>Data Caveats:</span></p><p><span>The SPoRT-LIS is as good as the input forcing analyses, so occasional soil moisture artifacts may appear in the horizontal maps related to quality-control issues of the input datasets.  These can be manifested with unusually low or high percentiles, especially along international borders, coastlines, and isolated dry “bulls-eyes” at rain gauge with quality issues.</span></p><p><span style='font-weight:bold;'>Data Visualization:</span></p><p><span>The Soil Moisture Percentile is the histogram rank of the current day’s soil moisture value compared to the 33-year climatology for the present day. The percentile places into historical context the soil moisture to determine how unusually wet or dry, or typical the conditions are.  Percentile thresholds as established by the drought community are used to categorize soil moisture dry anomalies as follows:</span></p><p><img src='https://maps.disasters.nasa.gov/arcgis/sharing/rest/content/items/3bf080c7aad445f2a524e7f24740f3d4/data?token=BJUrpEt48YVKfVsMOHNlJb99uNVFF2TsRh6epz2cuwaAs4utg45Z6bSbOiE0TMgJIYEIv_AmcNal9gcQfUh8fD9SGurY_ySakCQVNC1OqOCOcxHWnDPO4No_b1yyBqTFXVvBmRC15CbqZi9Rg7JQULcGgi9FzspLG7YVjCTUL5nCFjAg2uMd9muG9O_TcdK1Hby0hQcccnKohkZUHErvn0WD-fIDZvJUUdu5RemVo_0.' /><br /></p><p><span style='font-weight:bold;'>Further Reference:</span></p><p><span>NASA SPoRT project page: </span><a href='https://weather.ndc.nasa.gov:443/sport/' style='text-decoration:underline;'><span>https://weather.ndc.nasa.gov/sport/ </span></a></p><p><span>Real-time SPoRT-LIS viewer: </span><a href='https://weather.ndc.nasa.gov:443/sport/viewer/?dataset=lis_conus' style='text-decoration:underline;'><span>https://weather.ndc.nasa.gov/sport/viewer/?dataset=lis_conus</span></a></p><p><span>Access to real-time rolling archive of digital data and in various formats: </span><a href='https://geo.nsstc.nasa.gov:443/SPoRT/modeling/lis/conus3km/' style='text-decoration:underline;'><span>https://geo.nsstc.nasa.gov/SPoRT/modeling/lis/conus3km/</span></a></p><p><span>Daily animations of experimental 2-week forecasts of SPoRT-LIS soil moisture percentiles: </span><a href='https://geo.nsstc.nasa.gov:443/SPoRT/modeling/lis/conus3km/forecasts/' style='text-decoration:underline;'><span>https://geo.nsstc.nasa.gov/SPoRT/modeling/lis/conus3km/forecasts/</span></a></p><p><span>NASA Land Information System project page: </span><a href='https://lis.gsfc.nasa.gov:443/' style='text-decoration:underline;'><span>https://lis.gsfc.nasa.gov/</span></a></p><p><span>U.S. Drought Monitor page: </span><a href='https://droughtmonitor.unl.edu:443/' style='text-decoration:underline;'><span>https://droughtmonitor.unl.edu/</span></a></p><p><b>Esri REST Endpoint: <br /></b></p><p>See URL Section on right side of page</p><p><b>WMS Endpoint:<br /></b></p><p><a href='https://maps.disasters.nasa.gov/ags03/services/NRT/lis_vsm_percentile_100cm/ImageServer/WMSServer' target='_blank'>https://maps.disasters.nasa.gov/ags03/services/NRT/lis_vsm_percentile_100cm/ImageServer/WMSServer</a><br /></p><p><span></span></p></div>",
    "links": [
        {
            "rel": "wms",
            "href": "https://maps.disasters.nasa.gov/ags03/services/NRT/lis_vsm_percentile_100cm/ImageServer/WMSServer",
            "type": "image/png",
            "title": "Visualized through a WMS",
            "wms:layers": [
                "lis_vsm_percentile_100cm",
                "lis_vsm_percentile_100cm:lis_percentile_red-blue",
                "lis_vsm_percentile_100cm:None"
            ],
            "wms:styles": [
                "default"
            ]
        },
        {
            "rel": "via",
            "href": "https://maps.disasters.nasa.gov/ags03/rest/services/NRT/lis_vsm_percentile_100cm/ImageServer",
            "type": "text/html",
            "title": "Parent ArcGIS server url"
        }
    ],
    "stac_extensions": [
        "https://stac-extensions.github.io/web-map-links/v1.2.0/schema.json",
        "https://stac-extensions.github.io/datacube/v2.2.0/schema.json"
    ],
    "cube:variables": {},
    "cube:dimensions": {},
    "dashboard:is_periodic": false,
    "dashboard:time_density": "year",
    "title": "NRT/lis_vsm_percentile_100cm",
    "extent": {
        "spatial": {
            "bbox": [
                [
                    -124.94000000000003,
                    25.060000000000006,
                    -67.07000000000005,
                    52.92999999999999
                ]
            ]
        },
        "temporal": {
            "interval": [
                [
                    "2025-01-15T00:00:00Z",
                    "2025-02-13T00:00:00Z"
                ]
            ]
        }
    },
    "license": "not-applicable"
}