{"type": "Collection", "id": "nrt_lis_ak_rsm_40cm", "stac_version": "1.0.0", "description": "<div style='text-align:Left;'><div><div><p><span style='font-weight:bold;'>Background:</span></p><p><span>Land Information System (LIS) Relative Soil Moisture (RSM) from NASA’s SPoRT Center.</span></p><p><span>The NASA Short-term Prediction Research and Transition (SPoRT) Center runs the Alaska LIS (LIS-AK), a near-real-time version of the Noah land surface model at 0.03 degree resolution utilizing the NASA Land Information System (LIS) software.  The model input is the Global Data Assimilation (GDAS) forcing dataset, which is a near-real-time analysis of various observational data (ground, radar, satellite) consisting of surface meteorology (temperature, humidity, pressure, winds, precipitation) and downwelling long- and short-wave radiation.  Within LIS, the Noah model is forced by this input data and produces analyses of soil temperature and moisture in 4 layers plus the snow state and fluxes of energy and water at the surface.</span></p><p><span>RSM provides a measure of the soil saturation without having to consider the variation in soil type.  RSM is analogous to relative humidity for air saturation.  Thus, RSM provides an easy measure of the level of saturation as opposed to a volumetric value where the differing amounts of space between soil particles causes inconsistent volumetric maxima per soil type.  The water in the soil can be in liquid or frozen form.</span></p><p><span>The near-surface layer responds quickly to heavy rainfall and indicates near-saturated conditions conducive to significant runoff and river flooding, while the deeper column layers represent longer-term water storage via infiltration from upper layers.  These values can also be used as fire risk indicators since vegetation water is dependent on soil moisture, and the near-surface layer can be a proxy for moisture in surface fuels (duff or litter).</span></p><p><span>The Image Service is published using a Raster Mosaic populated with GeoTiffs collected from a SPoRT FTP site daily.</span></p><p><span style='font-weight:bold;'>Data Visualization:</span></p><p><span>Relative Soil Moisture (RSM) is shown using a Classified Color Ramp (Multi-Color, 20-classes). Values represent soil moisture scaled from 0% (wilting point, generally the lowest possible value) to 100% (full saturation) at each grid point.</span></p><p><span style='font-weight:bold;'>Limitations:</span></p><p><span>Inaccuracies in the forcing data will result in inaccuracies in model data.  Large portions of the state are data-sparse so the GDAS forcing data, and hence the LIS output, may be subject to larger errors than usual. </span></p><p><span style='font-weight:bold;'>Update Frequency:</span></p><p><span>Daily</span></p><p><span style='font-weight:bold;'>Suggested Usage:</span></p><p><span>Drought assessment, fire risk assessment, potential for flood hazards in periods of snow melt or heavy precipitation.  In steep terrain, near-saturated soil moisture can be associated with debris flows.</span></p><p><span style='font-weight:bold;'>Further Reference:</span></p><p><span>NASA SPoRT Land Information System for Alaska - Starter Guide</span></p><p><span>Learn more about NASA SPoRT program</span></p></div></div></div>", "links": [{"rel": "wms", "href": "https://maps.disasters.nasa.gov/ags03/services/NRT/lis_ak_rsm_40cm/ImageServer/WMSServer", "type": "image/png", "title": "Visualized through a WMS", "wms:layers": ["lis_ak_rsm_40cm", "lis_ak_rsm_40cm:lis_rsm", "lis_ak_rsm_40cm:None"], "wms:styles": ["default"]}, {"rel": "via", "href": "https://maps.disasters.nasa.gov/ags03/rest/services/NRT/lis_ak_rsm_40cm/ImageServer", "type": "text/html", "title": "Parent ArcGIS server url"}], "stac_extensions": ["https://stac-extensions.github.io/web-map-links/v1.2.0/schema.json", "https://stac-extensions.github.io/datacube/v2.2.0/schema.json"], "cube:variables": {}, "cube:dimensions": {}, "dashboard:is_periodic": false, "dashboard:time_density": "year", "title": "NRT/lis_ak_rsm_40cm", "extent": {"spatial": {"bbox": [[-168.001, 54.77999999999999, -129.99099999999999, 71.1]]}, "temporal": {"interval": [["2025-02-07T00:00:00Z", "2025-02-13T00:00:00Z"]]}}, "license": "not-applicable"}