{"type": "Collection", "id": "nrt_modis_flood_1_day", "stac_version": "1.0.0", "description": "<div><span style='font-weight: bold;'>Dates Available:</span><br /></div><div>Last 30 days<br /></div><div><br /></div><div style='text-align:Left;'><div><div><div><span style='font-weight: bold;'>Update Frequency:</span></div><div>Daily</div><div><span style='font-weight: bold;'><br /></span></div><span style='font-weight: bold;'>Bandwidth Use:</span><br /><div>High - zoom in to reduce loading time<br /></div><div><br /></div><div><div><span style='font-weight: bold;'>Suggested Usage:</span></div><div>Flood detection and showing areas of surface water inundation.</div></div><div><span style='font-weight: bold;'><br /></span></div><div><span style='font-weight: bold;'>Summary:</span></div><span></span><span>MODIS\n Flood 1 Day Observations is a collection of GeoTiffs representing 1D1OS\n WMP : 1 Day imagery, 1 Observations required, Terrain &amp; Cloud \nShadow Masking.</span><p><span>NASA Goddard's Hydrology Laboratory is \nworking to operationalize near real-time global flood mapping using \navailable satellite data resources -- currently the twice daily overpass\n of the MODIS instrument, on the Terra and Aqua satellites. We are \nworking to include additional data sources, such as Landsat and radar, \nto improve coverage and accuracy.</span></p><p><span>This work builds on\n the long-time expertise and efforts of the Dartmouth Flood Observatory \n(DFO) to map floodwater extent in detail for active floods. The DFO \nwebsite provides additional detail, additional products, and archives of\n historical flood maps. This NASA website provides links and information\n about the automated daily flood and surface water products produced at \nNASA Goddard.</span></p><p><span style='font-weight:bold;'>Note:</span></p><p><span>The\n MODIS Flood 3 Day Image Service is the representing the MODIS Water \nProduct (combines both MFW and MSW, raster only). There is no indication\n provided of where there is insufficient clear data in the given product\n to determine water extent. Thus, these products only indicate where \nwater has been detected, but the absence of a water polygon cannot be \ninterpreted to mean there was no water present in a given area; it may \nsimply have been sufficiently cloudy over the composite period for the \nrequired number of water observations to be met (the Y in composite \nindicator XDYO). The MWP product (below) attempts to address this \ndeficiency, and may eventually replace MFW and MSW. These vector \nproducts can also be extremely resource intensive to generate from the \nsource raster; a partly cloudy scene over water, or a tile over \nmountains with terrain shadow issues, can have tens of thousands of \npolygons, if we were to convert to shapefile or KMZ. Thus, we typically \nskip vector product generation if the number of polygons is greater than\n 20000. Currently delivered only in geotiff raster format.</span></p><p><span>We\n detect water using an algorithm developed by Bob Brakenridge of the \nDartmouth Flood Observatory. This algorithm uses a ratio of MODIS Band 1\n and Band 2, and a threshold on Band 7 to provisionally identify pixels \nas water. We then composite the water detections over the product window\n (2 days, typically). If a pixel is identified as water over several (2 \nor more) observations during the product window, it is then definitively\n marked as water, and output in the MSW, or &quot;MODIS Surface Water&quot; \nproduct. 2 (or more) observations are required because cloud shadow can \nappear quite spectrally similar to water.</span></p><p><span>In cases \nwhere cloud shadow occurs in the same spot in 2 observations, the \nproduct may incorrectly flag such areas as water. A 3 observation \nrequirement helps further, but also increases latency of the product. At\n the moment, we are using the 2 observation requirement as a balance \nbetween accuracy and timeliness. Finally, the detected water is compared\n to a reference water layer that shows &quot;normal&quot; water extent, and any \npixels found outside the normal water extent are marked as flood, and \noutput in the MFW (&quot;MODIS Flood Water&quot;) products.</span></p><p><span>The\n Image Service is published using a Raster Mosaic populated with “MWP” \nGeoTiffs collected from the NRT Global Flood Mapping Data Viewer site.</span></p><p><span style='font-weight:bold;'>Data Visualization:</span></p><p><span>MODIS Flood layer is represented using Unique Values Ranging from 0-3.</span></p><p><span>0 : Insufficient data to make water determination (cloudy, missing images, swath gaps, or bad data values).</span></p><p><span>1 : No water detected.</span></p><p><span>2 : Water detected AND coinciding with reference water (e.g., not flood).</span></p><p><span>3 : Water detected, beyond reference water, so may be flood.</span></p><br /><p><span style='font-weight:bold;'>Further Reference:</span></p><p><span>Learn more about MODIS Flood Products</span></p><p><span style='font-weight:bold;'>Purpose/Summary:</span></p><p><span>Flood Detection Map, MODIS Flood 1 Day (1D1OS), Updated Daily</span></p></div></div></div>", "links": [{"rel": "wms", "href": "https://maps.disasters.nasa.gov/ags03/services/NRT/modis_flood_1_day/ImageServer/WMSServer", "type": "image/png", "title": "Visualized through a WMS", "wms:layers": ["modis_flood_1_day", "modis_flood_1_day:modis_flood_lance", "modis_flood_1_day:None"], "wms:styles": ["default"]}, {"rel": "via", "href": "https://maps.disasters.nasa.gov/ags03/rest/services/NRT/modis_flood_1_day/ImageServer", "type": "text/html", "title": "Parent ArcGIS server url"}], "stac_extensions": ["https://stac-extensions.github.io/web-map-links/v1.2.0/schema.json", "https://stac-extensions.github.io/datacube/v2.2.0/schema.json"], "cube:variables": {}, "cube:dimensions": {}, "dashboard:is_periodic": false, "dashboard:time_density": "year", "title": "NRT/modis_flood_1_day", "extent": {"spatial": {"bbox": [[-180, -60, 180, 70]]}, "temporal": {"interval": [["2025-01-14T00:00:00Z", "2025-02-12T00:00:00Z"]]}}, "license": "not-applicable"}