{"type": "Collection", "id": "nrt_modis_flood_2_day", "stac_version": "1.0.0", "description": "<div style='text-align:Left;'><div><div><span style='font-weight: bold;'>Dates Available:</span><br /></div><div>Last 30 days<br /></div><div><br /></div><div><span style='font-weight: bold;'>Update Frequency:</span></div><div>Daily</div><div><span style='font-weight: bold;'><br /></span></div><span style='font-weight: bold;'>Bandwidth Use:</span><br /><div>High - zoom in to reduce loading time<br /></div><div><br /></div><div><div><span style='font-weight: bold;'>Suggested Usage:</span></div><div>Flood detection and showing areas of surface water inundation.</div></div><br /><span style='font-weight: bold;'></span><div><span style='font-weight: bold;'>Summary:</span></div><div><span>MODIS Flood 2 Day Observations is a collection of GeoTiffs representing 2D2OS WMP : 2 Day imagery, 2 Observations required, Terrain &amp; Cloud Shadow Masking.</span><p><span>NASA Goddard's Hydrology Laboratory is working to operationalize near real-time global flood mapping using available satellite data resources -- currently the twice daily overpass of the MODIS instrument, on the Terra and Aqua satellites. We are working to include additional data sources, such as Landsat and radar, to improve coverage and accuracy.</span></p><p><span>This work builds on the long-time expertise and efforts of the Dartmouth Flood Observatory (DFO) to map floodwater extent in detail for active floods. The DFO website provides additional detail, additional products, and archives of historical flood maps. This NASA website provides links and information about the automated daily flood and surface water products produced at NASA Goddard.</span></p><p><span style='font-weight:bold;'>Note:</span></p><p><span>The MODIS Flood 3 Day Image Service is the representing the MODIS Water Product (combines both MFW and MSW, raster only). There is no indication provided of where there is insufficient clear data in the given product to determine water extent. Thus, these products only indicate where water has been detected, but the absence of a water polygon cannot be interpreted to mean there was no water present in a given area; it may simply have been sufficiently cloudy over the composite period for the required number of water observations to be met (the Y in composite indicator XDYO). The MWP product (below) attempts to address this deficiency, and may eventually replace MFW and MSW. These vector products can also be extremely resource intensive to generate from the source raster; a partly cloudy scene over water, or a tile over mountains with terrain shadow issues, can have tens of thousands of polygons, if we were to convert to shapefile or KMZ. Thus, we typically skip vector product generation if the number of polygons is greater than 20000. Currently delivered only in geotiff raster format.</span></p><p><span>We detect water using an algorithm developed by Bob Brakenridge of the Dartmouth Flood Observatory. This algorithm uses a ratio of MODIS Band 1 and Band 2, and a threshold on Band 7 to provisionally identify pixels as water. We then composite the water detections over the product window (2 days, typically). If a pixel is identified as water over several (2 or more) observations during the product window, it is then definitively marked as water, and output in the MSW, or &quot;MODIS Surface Water&quot; product. 2 (or more) observations are required because cloud shadow can appear quite spectrally similar to water.</span></p><p><span>In cases where cloud shadow occurs in the same spot in 2 observations, the product may incorrectly flag such areas as water. A 3 observation requirement helps further, but also increases latency of the product. At the moment, we are using the 2 observation requirement as a balance between accuracy and timeliness. Finally, the detected water is compared to a reference water layer that shows &quot;normal&quot; water extent, and any pixels found outside the normal water extent are marked as flood, and output in the MFW (&quot;MODIS Flood Water&quot;) products.</span></p><p><span>The Image Service is published using a Raster Mosaic populated with “MWP” GeoTiffs collected from the NRT Global Flood Mapping Data Viewer site.</span></p><p><span style='font-weight:bold;'>Data Visualization:</span></p><p><span>MODIS Flood layer is represented using Unique Values Ranging from 0-3.</span></p><p><span>0 : Insufficient data to make water determination (cloudy, missing images, swath gaps, or bad data values).</span></p><p><span>1 : No water detected.</span></p><p><span>2 : Water detected AND coinciding with reference water (e.g., not flood).</span></p><p><span>3 : Water detected, beyond reference water, so may be flood.</span></p><b>Resolution:<br /></b>~250 meters<br /><p><span style='font-weight:bold;'>Further Reference:</span></p><p><span>Learn more about MODIS Flood Products</span></p><p><span style='font-weight:bold;'>Purpose/Summary:</span></p><p><span>Flood Detection Map, MODIS Flood 2 Day (2D2OS), Updated Daily</span></p></div></div></div>", "links": [{"rel": "wms", "href": "https://maps.disasters.nasa.gov/ags03/services/NRT/modis_flood_2_day/ImageServer/WMSServer", "type": "image/png", "title": "Visualized through a WMS", "wms:layers": ["modis_flood_2_day", "modis_flood_2_day:modis_flood_lance", "modis_flood_2_day:None"], "wms:styles": ["default"]}, {"rel": "via", "href": "https://maps.disasters.nasa.gov/ags03/rest/services/NRT/modis_flood_2_day/ImageServer", "type": "text/html", "title": "Parent ArcGIS server url"}], "stac_extensions": ["https://stac-extensions.github.io/web-map-links/v1.2.0/schema.json", "https://stac-extensions.github.io/datacube/v2.2.0/schema.json"], "cube:variables": {}, "cube:dimensions": {}, "dashboard:is_periodic": false, "dashboard:time_density": "year", "title": "NRT/modis_flood_2_day", "extent": {"spatial": {"bbox": [[-180, -60, 180, 70]]}, "temporal": {"interval": [["2025-01-14T00:00:00Z", "2025-02-12T00:00:00Z"]]}}, "license": "not-applicable"}