{
    "type": "Collection",
    "id": "california_wildfires_202501_optisar_fireseverity",
    "stac_version": "1.0.0",
    "description": "Dates of ImagesSentinel-1 and Sentinel-2 pre-fire collection: January 2018 to November 2024Sentinel-1 post-fire image: 21st January 2025Sentinel-2 post-fire image: 12th January 2025Date of Next ImageNoneSummaryFire severity refers to the degree of change caused by fire in the state of vegetation, encompassing both aboveground and belowground impacts. It reflects the extent of fuel consumption, vegetation mortality, and structural damage caused by the fire. Accurately mapping fire severity is critical for understanding ecological impacts, informing post-fire recovery strategies, and supporting emergency response efforts.The 2025 Southern California fire episode marked one of the most severe global fire events in recent history. It resulted in extensive ecological and structural damage, particularly within the wildland-urban interface (WUI), where anthropogenic development interacts with fire-prone vegetation. The Palisades and Eaton fires were among the most severe, driven by prolonged drought, anomalously high temperatures, and strong synoptic-scale wind patterns. Given the large-scale ecosystem disturbances and infrastructural losses, an independent fire severity assessment for each fire is essential to quantify post-fire ecological impacts and inform resilience strategies. Traditionally, fire severity has been assessed both qualitatively and quantitatively through field surveys conducted by forest professionals. These assessments provide detailed on-the-ground observations but are often constrained by logistical challenges, such as less frequency of visit and limited spatial coverage. As a result, satellite remote sensing has become the preferred approach for fire severity mapping due to its ability to provide high-frequency, high-resolution, and continuous data over large spatial extents. To address this need, this study employs the “OptiSAR” framework, a multi-sensor remote sensing approach, for enhanced fire severity assessment by integrating Synthetic Aperture Radar (SAR; Sentinel-1) and multispectral optical imagery (Sentinel-2). By leveraging SAR’s all-weather and day/night capability and its sensitivity to structural changes in vegetation, along with optical indices' ability to capture spectral responses of burned landscapes, the “OptiSAR” enables a comprehensive and multi-dimensional assessment of fire-induced transformations.Satellite/Sensor &amp; ResolutionSentinel-1/ C-Band /10m spatial resolution.Sentinel-2/ MSI /resampled spatial resolution from 20m to 10m.MethodologyIndependent fire severity analyses were conducted for the Palisades and Eaton fires due to their distinct vegetation characteristics and fire dynamics. The Palisades and Eaton fires burned under different conditions, each with unique fire behavior and impacts. The Palisades fire spread rapidly due to strong coastal winds and dry fuels, leading to high-intensity burns. In contrast, the Eaton fire, with more varied terrain and denser fuel accumulation, burned at a different pace, resulting in distinct structural and spectral fire effects. The study area consists of chaparral, and coastal sage scrub, with chaparral being the dominant fire-prone vegetation type. It comprises dense, drought-adapted shrubs which accumulate dry biomass, contributing to high fire intensity. Coastal sage scrub and oak woodlands are also present, with varying degrees of fire adaptation.The fire severity was divided into five classes and color-coded for intuitive visualization. Pixels in green show ‘unburnt’ representing undisturbed vegetation, yellow depict ‘low’ indicating areas with surface fuel depletion but an intact canopy. Orange represents ‘moderate’, signifying partial canopy scorch with some structural damage. Red denotes ‘high’, where complete canopy scorch and significant structural damage have occurred. Black indicates ‘extreme’, describing areas with total canopy consumption and collapse, resulting in extensive structural destruction.To quantify changes in vegetation, two advanced change detection indices were employed: the RADAR-Vegetation Structural Perpendicular Index (RADAR-VSPI; Chhabra et al., 2022) and the Vegetation Structural Perpendicular Index (VSPI; Massetti et al., 2019). These indices represent a significant advancement over conventional vegetation characterization and burn severity indices by providing more detailed insights into disturbance-induced transformations as a function of their undisturbed state from the pre-fire period. To compute RADAR-VSPI and VSPI, a pixel-wise baseline was established using a time series of Sentinel-1 and Sentinel-2 data from January 2018 to November 2024. This baseline represented the spatiotemporal characteristics of undisturbed vegetation, identified from periods with no observed disturbances in both SAR and optical datasets. Post-fire vegetation changes were then quantified as an orthogonal distance from this baseline. Independent fire severity classifications were performed separately on the post-fire RADAR-VSPI (21st January 2025) and VSPI (12th January 2025) acquisitions using K-means clustering. This unsupervised classification method was chosen due to its ability to objectively segment the data into distinct severity levels based on natural groupings within the distribution of RADAR-VSPI and VSPI values. Unlike threshold-based approaches, K-means clustering allows for a data-driven classification, reducing subjective biases in defining severity categories while ensuring adaptability across different fire-affected landscapes. From the clustering results, the severity class ranges for RADAR-VSPI and VSPI were derived, establishing quantitative thresholds that delineate the gradient of fire-induced vegetation and structural changes. Higher negative decibel values of RADAR-VSPI indicate greater structural destruction, whereas higher values in VSPI indicate greater vegetation damage. To systematically classify fire severity based on the synergies between RADAR-VSPI and VSPI, a high-level decision-tree algorithm was developed, enabling a data-driven approach to delineate fire impacts across varying burn intensities.Table 1: Fire severity classification ranges for the Palisades fire\n\n\n \n  \n  Fire Severity Class\n  \n  \n  RADAR-VSPI [dB]\n  \n  \n  VSPI [-]\n  \n \n \n  \n  Unburnt (green)\n  \n  \n  0.107 &lt;= value &lt;\n  3.68\n  \n  \n  (-68.804) &lt; value &lt;=\n  142.064\n  \n \n \n  \n  Low (yellow)\n  \n  \n  (-1.027) &lt;= value &lt; 0.107\n  \n  \n  142.064 &lt; value &lt;=\n  406.705\n  \n \n \n  \n  Moderate (orange)\n  \n  \n  (-1.992) &lt;= value &lt;\n  (-1.027)\n  \n  \n  406.705 &lt; value &lt;=\n  700.930\n  \n \n \n  \n  High (red)\n  \n  \n  (-3.138) &lt;= value &lt;\n  (-1.992)\n  \n  \n  700.930 &lt; value &lt;=\n  920.930\n  \n \n \n  \n  Extreme (black)\n  \n  \n  (-5.472) &lt;= value &lt;\n  (-3.138)\n  \n  \n  920.930 &lt; value &lt;=\n  1388.730\n  \n \nTable 2: Fire severity classification ranges for the Eaton fire\n \n  \n  Fire Severity Class\n  \n  \n  RADAR-VSPI [dB]\n  \n  \n  VSPI [-]\n  \n \n \n  \n  Unburnt (green)\n  \n  \n  0.895 &lt;= value &lt; 2.984\n  \n  \n  (-49.594) &lt; value &lt;=\n  116.854\n  \n \n \n  \n  Low (yellow)\n  \n  \n  (-0.834) &lt;= value &lt; 0.895\n  \n  \n  116.854 &lt; value &lt;= 392.053\n  \n \n \n  \n  Moderate (orange)\n  \n  \n  (-2.227) &lt;= value &lt;\n  (-0.834)\n  \n  \n  392.053 &lt; value &lt;= 572.801\n  \n \n \n  \n  High (red)\n  \n  \n  (-3.503) &lt;= value &lt;\n  (-2.227)\n  \n  \n  572.801 &lt; value &lt;= 794.519\n  \n \n \n  \n  Extreme (black)\n  \n  \n  (-5.945) &lt;= value &lt;\n  (-3.503)\n  \n  \n  794.519 &lt; value &lt;= 1570.733\n  \n \nSuggested UseThe Palisades Fire severity classification map highlights widespread ‘high’ to ‘extreme’ severity burns across the Santa Monica Mountains and surrounding areas, particularly in Topanga State Park, Temescal Gateway Park, and Monte Nido. These areas, dominated by chaparral and coastal sage scrub, experienced intense fire behavior, resulting in significant vegetation loss. The western sections, including areas near Saddle Peak Trailhead, also show severe burns following ridgelines and steep slopes, reinforcing the role of topography in fire intensity. In contrast, ‘moderate’ and ‘low’ severity burns appear in scattered patches, particularly near Topanga, Sylvia Park, and portions of Mandeville and Rustic Canyons, where surface fuels burned but some canopy remained intact. Additionally, vegetation in green ‘unburnt’ is mapped along the Pacific Coast Highway, near Malibu, Pacific Palisades, and Brentwood, suggesting fire suppression efforts or natural firebreaks may have limited spread in these areas.The Eaton Fire severity classification map shows extensive ‘high’ to ‘extreme’ severity burns in the San Gabriel Mountains, particularly around Mount Wilson Observatory, Big Santa Anita Canyon, Sturtevant Falls, and Echo Mountain. These regions, characterized by steep terrain and mixed chaparral-woodland vegetation, experienced severe fire effects, leading to complete canopy consumption. The northwestern portions, including Dawn Mine and sections of the San Gabriel Mountains, also exhibit intense burns along ridgelines, aligning with expected fire spread dynamics in mountainous landscapes. In contrast, ‘moderate’ and ‘low’ severity burns are more scattered, particularly in Kinneloa Mesa and sections of Santa Anita Canyon, where some structural elements of the vegetation were retained despite surface fuel consumption. At the southern edge, near Altadena, Hastings Ranch, and Sierra Madre, ‘unburnt’ vegetation is observed, marking areas that remained unaffected within the fire perimeter.Terms of Use &amp; LimitationsThis product is only relevant to fire impacts to vegetation and should not be used to understand impacts to built infrastructure.A key limitation of the fused fire severity product is its dependence on the quality of pre-disturbance baseline data. Inconsistencies or gaps in the baseline—particularly in areas with frequent vegetation changes or limited temporal coverage—can impact classification accuracy. Additionally, in highly mixed vegetation landscapes such as chaparral shrublands, RADAR-VSPI’s structural sensitivity may dominate, potentially masking subtle spectral changes captured by VSPI. These challenges emphasize the need for ongoing refinement, improved temporal consistency, and ground-truth validation to enhance classification reliability.Despite its limitations, the fire severity classification provides a general assessment of fire perimeters and vegetation damage. It can aid in post-fire recovery planning, such as soil stabilization in affected areas. The severity map also distinguishes between areas of structural collapse and regions where surface burns occurred while vegetation structure remained intact, offering insights for targeted mitigation efforts. Additionally, it may support long-term monitoring in the WUI, helping assess ecosystem recovery and fire behavior trends over time.This enhanced fire severity product should be used with caution as a qualitative guide rather than an absolute measure of fire impacts. The classification is based on satellite-derived indices and may be influenced by factors such as sensor limitations, baseline data availability, and local vegetation variability.NASA data and products are freely available to federal, state, public, non-profit, and commercial users. However, these datasets are primarily experimental or research-grade and may not be suitable for operational applications requiring real-time accuracy or consistency. The NASA Disasters Mapping Portal and associated data products are designed to support decision-making and enhance situational awareness, but availability and updates are not guaranteed on a routine basis.Credits1. Aakash Chhabra (NASA Ames/NEX; aakash.chhabra7489@gmail.com),2. Taejin Park (NASA Ames/NEX),3. Ian Brosnan (NASA Ames/NEX)Data Sourcesa . Sentinel-1 (GRD pre-processed product): https://developers.google.com/earthengine/datasets/catalog/COPERNICUS_S1_GRD#descriptionb. Sentinel-2 (2A atmospherically corrected product): https://developers.google.com/earthengine/datasets/catalog/COPERNICUS_S2_SR_HARMONIZEDc. ESA Landcover: https://developers.google.com/earthengine/datasets/catalog/ESA_WorldCover_v200d. Fire Perimeter: https://www.nifc.gov/fire-information/mapsEsri REST EndpointSee URL to the right.Data Downloadhttps://maps.disasters.nasa.gov/download/gis_products/event_specific/2025/california_wildfires_202501/s1_2_fire_severity/",
    "links": [
        {
            "rel": "wms",
            "href": "https://maps.disasters.nasa.gov/ags03/services/california_wildfires_202501/OptiSAR_FireSeverity/MapServer/WMSServer",
            "type": "image/png",
            "title": "Visualized through a WMS",
            "wms:layers": [
                "Palisades Fire Severity",
                "Eaton Fire Severity"
            ],
            "wms:styles": [
                "default"
            ]
        },
        {
            "rel": "via",
            "href": "https://maps.disasters.nasa.gov/ags03/rest/services/california_wildfires_202501/OptiSAR_FireSeverity/MapServer",
            "type": "text/html",
            "title": "Parent ArcGIS server url"
        }
    ],
    "stac_extensions": [
        "https://stac-extensions.github.io/web-map-links/v1.2.0/schema.json"
    ],
    "dashboard:is_periodic": false,
    "dashboard:time_density": "year",
    "dashboard:is_timeless": true,
    "title": "california_wildfires_202501/OptiSAR_FireSeverity",
    "extent": {
        "spatial": {
            "bbox": [
                [
                    -118.68495868605262,
                    34.02781253194759,
                    -118.01388983108468,
                    34.23835808467275
                ]
            ]
        },
        "temporal": {
            "interval": [
                [
                    null,
                    null
                ]
            ]
        }
    },
    "license": "not-applicable"
}